hadlerla/windowsensor/sdkconfig.defaults
# Default configuration for ESP32-C6-WROOM-1 window sensor
CONFIG_IDF_TARGET_ESP32C6=y
CONFIG_IDF_TARGET="esp32c6"

# Application configuration
CONFIG_FREERTOS_HZ=1000

# ============================================================================
# Window Sensor Configuration - Milestone M1
# ============================================================================

# Hardware Pin Assignments
CONFIG_RGB_LED_GPIO=8
CONFIG_AP_BUTTON_GPIO=9
CONFIG_WINDOW_SENSOR_GPIO=4

# WiFi Configuration
CONFIG_WIFI_AP_SSID_PREFIX="WindowSensor"
CONFIG_WIFI_AP_PASSWORD="configure"
CONFIG_WIFI_AP_CHANNEL=1
CONFIG_WIFI_AP_MAX_CONNECTIONS=4
CONFIG_WIFI_CONNECT_TIMEOUT_MS=30000
CONFIG_WIFI_MAX_RETRY_ATTEMPTS=3
CONFIG_WIFI_RETRY_BACKOFF_BASE_MS=10000

# Web Server Configuration
CONFIG_WEB_SERVER_PORT=80
CONFIG_WEB_SERVER_MAX_SESSIONS=4
CONFIG_WEB_SESSION_TIMEOUT_SEC=300
CONFIG_WEB_MAX_AUTH_ATTEMPTS=5
CONFIG_WEB_AUTH_LOCKOUT_SEC=60

# LED Configuration
CONFIG_BLINK_LED_STRIP=y
CONFIG_BLINK_LED_STRIP_BACKEND_RMT=y
CONFIG_BLINK_LED_STRIP_BACKEND_SPI=n
CONFIG_LED_BRIGHTNESS=64
CONFIG_LED_BLINK_RATE_SLOW_MS=1000
CONFIG_LED_BLINK_RATE_FAST_MS=250

# Device Configuration
CONFIG_DEVICE_PIN_LENGTH=8
CONFIG_AP_BUTTON_HOLD_TIME_MS=5000
CONFIG_DEBOUNCE_DELAY_MS=50

# Storage Configuration
CONFIG_NVS_PARTITION_SIZE_KB=24

# Legacy compatibility (auto-derived from new configs)
CONFIG_BLINK_GPIO=8
CONFIG_BLINK_PERIOD=1000
CONFIG_STATUS_LED_GPIO=8
CONFIG_SENSOR_POLL_PERIOD_MS=1000

# Logging configuration
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Compiler options
CONFIG_COMPILER_OPTIMIZATION_SIZE=y